"""
Реализовать класс фигуры. На основе фигуры реализовать класс треугольника, квадрата и прямоугольника с методами
подсчета площади и периметра. Методы должны возвращать значение, а не принтить

Triangle
square
rectangle
"""


class Shape:
    """all shapes"""
    def __init__(self, a, b, c, h):
        """All names"""
        self.a = a
        self.b = b
        self.c = c
        self.h = h


class Triangle:
    def __mul_(a,h):
        Square = (a * h) / 2
        return Square

    def perimeter(a,b,c):
        P = a + b +c
        return P

a = 12
h= 3
print(Triangle.__m

      test
