"""
1.Написать функцию, которая выведет все пятницы 13-го в указаном году. Использовать можно все что прошли
"""



"""
2.Реализовать функции min и max
Функции принимают 1 аргумент (list с числами) и возвращает максимальное/минимальное значение. Использовать сортировку нельзя.
"""


"""
3.Написать функцию, которая принимает 1 аргумент — год, и возвращающую True, если год високосный, иначе False
"""


"""
4.Написать игру. 2 игрока бросают игровые кубики по 10 раз,

нужно определить кто выиграл и вывести результаты обоих игроков (суммы бросков).

Если у двух игроков за 1 ход выпало на кубиках одинаковое число, то игроки перебрасывают кубики.

(модуль random)
"""


"""
5.Написать функцию для сортировки для данного списка словарей.

Сортировать по ключу `name`, если такого ключа нету в словаре, то по ключу `lastname`

data = [
    {'name': 'Bill', 'lastname': 'Boll'},
    {'name': 'Bob', 'lastname': 'Zip'},
    {'lastname': 'Fuf'},
    {'lastname': 'Albertus'},
    {'name': 'Dimon', 'lastname': 'Nomid'},
]

def sort_func(i):
    ...

data.sort(key=sort_func)
print(data.sort)
"""